app/controllers/movies_controller.rb

  def index
    sort = params[:sort]
    @movies = Movie.order("#{sort}")
---
SELECT "movies".* FROM "movies" WHERE (rating LIKE 'G','PG')